---
kind: property
id: P:Autodesk.Revit.DB.ScheduleHeightsOnSheet.ColumnHeaderHeight
source: html/e4657939-ebcf-84d8-a277-9c0cd977808f.htm
---
# Autodesk.Revit.DB.ScheduleHeightsOnSheet.ColumnHeaderHeight Property

The height of all schedule header part, including the gap line between header and body.

## Syntax (C#)
```csharp
public double ColumnHeaderHeight { get; }
```